# **(ETL Pipeline)**

## Day 1: Ideation, ETL Implementation, Basic Visualisations:

* Activities & Expected Outcomes:
Ideation Session: Brainstorm and discuss potential project ideas that address real or imagined user needs. You can use your classmates as proxy users to bounce ideas off.
Project Proposal: Create a project proposal outlining the chosen idea, target audience, and main features. Choose a project idea that matches your intended future data analyst role (or one that looks most enjoyable)
Initial data extraction and cleaning.
Milestone and Deliverable Planning: Set up a GitHub repository and project Kanban board, define user stories, and map them to the project goals.
Creation of basic visualisations
Expected Outcomes:
Clear project plan and defined roles.
Cleaned and transformed dataset ready for analysis.
Initial visualisations provide basic insights.

## Activities Per Role Day 1
## Project Management

* Day 1:

- Come up with project ideas during the ideation session.
- Refine and select the final project idea, ensuring it aligns with the individual formative assignment's guidelines.
- Create a GitHub repository.  
- Set up the project board using GitHub Projects or Trello, creating and assigning user stories and supporting tasks.
- Monitor deliverable progress and resolve any roadblocks. 

## ETL

* Day 1:

- Extract data from the dataset.
- Clean and transform data.
- Load data into a suitable format for analysis.
- Ensure data quality and consistency.

# Data Extract

# Working Insights

# Loading the CSV files
- Here I load the 3 csv files which have been saved into my Retail Sales Analysis folder

* Here below is the first csv file I have loaded which is the "stores" data set
  - I wanted to code it so this shows the first 5 rows of the data set

In [9]:
import pandas as pd

# Load CSV files
stores = pd.read_csv("../Data/Raw/stores_data-set.csv")
stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

* Here below is the second csv file I have loaded which is the "features" data set
  - I wanted to code it so this shows the first 5 rows of the data set

In [10]:
features = pd.read_csv("../Data/Raw/Features_data_set.csv")
features.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,26/02/2010,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,05/03/2010,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

* Here below is the second csv file I have loaded which is the "sales" data set
  - I wanted to code it so this shows the first 5 rows of the data set

In [11]:
sales = pd.read_csv("../Data/Raw/stores_data-set.csv")
sales.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

* Now I am going to display a summary of the data frame using features using pandas:
  - This will show the number o
  - The number of rows and columns
  - The column names and their data types
  - The number of non-null (non-missing) values in each column
  - The amount of memory used by the DataFrame

In [12]:
features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

# Merging
* Merging the sales dataframe with the stores dataframe using the "store" column.
* Merges the resulting dataframe with the features data frame again using the "store" column.

In [15]:
df = sales.merge(stores, on="Store").merge(features, on="Store")

# Displaying the DataFrame
  - Below in the df code you can see the displayed contents of the DataFrame.
  - This is showing a table of the merged data from the sales, stores and features where the store values match in each DataFrame

In [16]:
df

,Store,Type_x,Size_x,Type_y,Size_y,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,A,151315,A,151315,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,A,151315,A,151315,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,A,151315,A,151315,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,A,151315,A,151315,26/02/2010,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,A,151315,A,151315,05/03/2010,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8185,45,B,118221,B,118221,28/06/2013,76.05,3.639,4842.29,975.03,3.00,2449.97,3169.69,NaN,NaN,False
8186,45,B,118221,B,118221,05/07/2013,77.50,3.614,9090.48,2268.58,582.74,5797.47,1514.93,NaN,NaN,False
8187,45,B,118221,B,118221,12/07/2013,79.37,3.614,3789.94,1827.31,85.72,744.84,2150.36,NaN,NaN,False
8188,45,B,118221,B,118221,19/07/2013,82.84,3.737,2961.49,1047.07,204.19,363.00,1059.46,NaN,NaN,False
8189,45,B,118221,B,118221,26/07/2013,76.06,3.804,212.02,851.73,2.06,10.88,1864.57,NaN,NaN,False

* I will now do a code df.isnull().sum() which is checking for missing (null) values in the DataFrame df.

- This is a df.isnull() which returns a DataFrame of the same shape as df, with True where values are missing and False otherwise.
- Then the .sum() will then add up the True values (which count as 1) for each column.

In [17]:
df.isnull().sum()

Store              0
Type_x             0
Size_x             0
Type_y             0
Size_y             0
Date               0
Temperature        0
Fuel_Price         0
MarkDown1       4158
MarkDown2       5269
MarkDown3       4577
MarkDown4       4726
MarkDown5       4140
CPI              585
Unemployment     585
IsHoliday          0
dtype: int64

* Looping the Markdown columns
  - It loops through the list of markdown columns: 'MarkDown1', 'MarkDown2', 'MarkDown3', 'MarkDown4', 'MarkDown5'.
  - For each column, it checks if the column is present in df.
  - If the column exists, it fills any missing values in that column with 0
  - This will help clean the missing values in the data

In [ ]:
for col in ['MarkDown1', 'MarkDown2', 'MarkDown3', 'MarkDown4', 'MarkDown5', ]:
    if col in df.columns:
        df[col] = df[col].fillna(0)

* After running the code that fills missing values in the markdown columns, df now contains those columns with all missing values replaced by 0.

In [19]:
df

,Store,Type_x,Size_x,Type_y,Size_y,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,A,151315,A,151315,05/02/2010,42.31,2.572,0.00,0.00,0.00,0.00,0.00,211.096358,8.106,False
1,1,A,151315,A,151315,12/02/2010,38.51,2.548,0.00,0.00,0.00,0.00,0.00,211.242170,8.106,True
2,1,A,151315,A,151315,19/02/2010,39.93,2.514,0.00,0.00,0.00,0.00,0.00,211.289143,8.106,False
3,1,A,151315,A,151315,26/02/2010,46.63,2.561,0.00,0.00,0.00,0.00,0.00,211.319643,8.106,False
4,1,A,151315,A,151315,05/03/2010,46.50,2.625,0.00,0.00,0.00,0.00,0.00,211.350143,8.106,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8185,45,B,118221,B,118221,28/06/2013,76.05,3.639,4842.29,975.03,3.00,2449.97,3169.69,NaN,NaN,False
8186,45,B,118221,B,118221,05/07/2013,77.50,3.614,9090.48,2268.58,582.74,5797.47,1514.93,NaN,NaN,False
8187,45,B,118221,B,118221,12/07/2013,79.37,3.614,3789.94,1827.31,85.72,744.84,2150.36,NaN,NaN,False
8188,45,B,118221,B,118221,19/07/2013,82.84,3.737,2961.49,1047.07,204.19,363.00,1059.46,NaN,NaN,False
8189,45,B,118221,B,118221,26/07/2013,76.06,3.804,212.02,851.73,2.06,10.88,1864.57,NaN,NaN,False

* Again the code df.isnull().sum() checks for missing (null) values in each column of the DataFrame df and returns the total number of missing values per column.

In [21]:
df.isnull().sum()

Store             0
Type_x            0
Size_x            0
Type_y            0
Size_y            0
Date              0
Temperature       0
Fuel_Price        0
MarkDown1         0
MarkDown2         0
MarkDown3         0
MarkDown4         0
MarkDown5         0
CPI             585
Unemployment    585
IsHoliday         0
dtype: int64

* This code is checking for missing values in the 'CPI' and 'Unemployment' columns of the DataFrame df:
  - prints the number of missing(null) values in the columns
  - calculates the percentage of missing values in each column by the mean of the boolean mask.
  - prints the percentage of missing values  for "CPI" and "Unemployment"

In [22]:
print(df[['CPI', 'Unemployment']].isnull().sum())
print(df[['CPI', 'Unemployment']].isnull().mean() * 100)  # percentage

CPI             585
Unemployment    585
dtype: int64
CPI             7.142857
Unemployment    7.142857
dtype: float64

* This code below fills missing values in the 'CPI' and 'Unemployment' columns of the DataFrame df using forward fill, which is done by each store gruop.
  - df.groupby('Store'), 'CPI' groups the DataFrame by the 'Store' column and selects the 'CPI' column for each group.
  - .transform(lambda x: x.fillna(method='ffill')) applies a forward fill (ffill) to each group, filling missing values with the last known value within that store.
  - The result is assigned back to df'CPI', updating the column with the filled values.
  - The same process is repeated for the 'Unemployment' column.

In [25]:
df['CPI'] = df.groupby('Store')['CPI'].transform(lambda x: x.fillna(method='ffill'))
df['Unemployment'] = df.groupby('Store')['Unemployment'].transform(lambda x: x.fillna(method='ffill'))

C:\Users\ajayc\AppData\Local\Temp\ipykernel_3916\938333994.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['CPI'] = df.groupby('Store')['CPI'].transform(lambda x: x.fillna(method='ffill'))
C:\Users\ajayc\AppData\Local\Temp\ipykernel_3916\938333994.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Unemployment'] = df.groupby('Store')['Unemployment'].transform(lambda x: x.fillna(method='ffill'))

*  Again the code df.isnull().sum() checks for missing (null) values in each column of the DataFrame df and returns the total number of missing values per column.
   - This will give the data a quality check and will determine weather further cleaning or imputation is required.

In [26]:
df.isnull().sum()

Store           0
Type_x          0
Size_x          0
Type_y          0
Size_y          0
Date            0
Temperature     0
Fuel_Price      0
MarkDown1       0
MarkDown2       0
MarkDown3       0
MarkDown4       0
MarkDown5       0
CPI             0
Unemployment    0
IsHoliday       0
dtype: int64

# Cleaned Data
* Now I am going to save my cleaned DataFrame to a CSV file to export the cleaned data for use in the Data Visualisation

In [27]:
cleaned_data = '../Data/Cleaned/cleaned_data_set.csv'
df.to_csv(cleaned_data, index=False)
print(f'Cleaned data saved to {cleaned_data}')

Cleaned data saved to ../Data/Cleaned/cleaned_data_set.csv

* This is the file path where the cleaned data is saved: cleaned_data = '../Data/Cleaned/cleaned_data_set.csv'

* df.to_csv(cleaned_data, index=False)
Saves the DataFrame df as a CSV file at the specified path, without writing row indices.

* print(f'Cleaned data saved to {cleaned_data}')
Prints a message confirming the file has been saved and shows the file path.